{
  "The Lonely Veil": {
    "text": "Your name is Aragon and you are a top general of a rebel group called Shrouded. You guys finally get enough resources and courage to rebel against the big corporations that run the world and have used up the world’s resources for their own greed. Your rebellion fails, but you somehow manage to survive. Your friends, colleagues, and leaders are all gone. You have nothing left and you are being hunted by human and AI soldiers trained to hunt down fugitives. You also have a bounty out for you, so even local bounty hunters are pursuing you. You are smart and resourceful and have deep connections to a flourishing black market. You have heard of a better life somewhere far away and this is your only chance. You disguise yourself and go into the city’s slums. You find 3 people that have information about how you can get out of earth.",
    "choices": {
      "Who will you trust?": "Who will you trust?"
    }
  },
  "Who will you trust?": {
    "text": "",
    "choices": {
      "Zel": "Zel",
      "Vex": "Vex",
      "Node-9": "Node-9",
      "The Broker": "The Broker"
    }
  },
  "Zel": {
    "text": "Intelligent, anxious, reserved\nHas guilt, No courage\nInsider knowledge about technology and space travel\nWill help you with Ids, hangars, space craft",
    "choices": {
      "A guard sees you guys trying to board a ship and is suspicious": "A guard sees you guys trying to board a ship and is suspicious"
    }
  },
  "Vex": {
    "text": "Witty, seductive, unpredictable\nHas connections in the bounty underworld and with smugglers, so you will be able to travel through secret routes as she has access to\nDodge other bounty hunters but she may cross you\nShe wants to bring a friend when you guys are working together already",
    "choices": {
      "Sure": "Sure",
      "You refuse": "You refuse"
    }
  },
  "Node-9": {
    "text": "Glitchy, philosophical, occasionally prophetic \nSpeaks in riddles and past data.\nGives you some information about the history of the wormholes and where it may lead to.\nCould lead to misinformation or glitch out.\n40% of glitching out and shutting down",
    "choices": {
      "Take him to a black market repair shop": "Take him to a black market repair shop ",
      "Roll with the AI as": "Roll with the AI as"
    }
  },
  "The Broker": {
    "text": "Elusive, calculating\nCold and only values information and trade.\nKnows information about your hunters, the wormholes and gives you a detailed plan to get out of earth.\n0% chance of survival.",
    "choices": {
      "Trust": "Trust"
    }
  },
  "Take him to a black market repair shop ": {
    "text": "Risk being caught and sent to the government.",
    "choices": {
      "You encounter a guard ship right outside of earth": "You encounter a guard ship right outside of earth"
    }
  },
  "Roll with the AI as": {
    "text": "Risk Node-9 glitching out and shutting down",
    "choices": {}
  },
  "You refuse": {
    "text": "She is able to give you safe passage out of earth and into the asteroid belt.",
    "choices": {
      "You encounter an asteroid": "You encounter an asteroid"
    }
  },
  "Sure": {
    "text": "He is knowledgeable and her closest friend and could really help with the mission and getting what you need to survive the esacpe mission\nHe convinces Vex to turn you in and the game ends.",
    "choices": {}
  },
  "You encounter an asteroid": {
    "text": "You're cruising fast through the outer rim of the asteroid belt with Vex in the pilot seat, her boots kicked up, chewing some synthetic gum like she’s on a joyride.\n\nVex smirks:\n\"You really trust me flying this close to the rocks? Brave, or stupid?\"\n\nSuddenly, a massive warning klaxon blares across the console.\n\nNODE-9 (through comms):\n\"Impact imminent. One object detected. Velocity—high. Recommendation: evasive maneuver.\"\n\nAhead, a mid-sized asteroid spins toward you. You’ve got two seconds.",
    "choices": {
      "Dodge It": "Dodge It",
      "Absorb it with your rear haul": "Absorb it with your rear haul"
    }
  },
  "You encounter a guard ship right outside of earth": {
    "text": "",
    "choices": {
      "Engage with the guard ship using protocol that AI knows": "Engage with the guard ship using protocol that AI knows",
      "Go into stealth mode": "Go into stealth mode"
    }
  },
  "A guard sees you guys trying to board a ship and is suspicious": {
    "text": "You're in the shadows of Dock 7, the wind from distant thrusters roaring around you. Zel checks the forged access codes again. One ship waits on the pad: a corporate cargo hauler. You hear footsteps—not security, but someone else.\n\nA figure in a long coat steps from the smoke. His voice cuts through the static:\n\"You don't have to do this the hard way. There's another way off this rock, cleaner. Safer. Trust me.\"\n\nZel stiffens.\n\"That’s a Broker runner. I told you not to deal with them.\"",
    "choices": {
      "We stick to the plan. We fly quiet, and we fly now.": "We stick to the plan. We fly quiet, and we fly now.",
      "Wait. What kind of deal are we talking about?": "Wait. What kind of deal are we talking about?"
    }
  },
  "We stick to the plan. We fly quiet, and we fly now.": {
    "text": "Game continues, Zel safely guides you through the asteroid belt and into the 3 wormholes.",
    "choices": {
      "Final Approach": "Final Approach"
    }
  },
  "Wait. What kind of deal are we talking about?": {
    "text": "Wait. What kind of deal are we talking about?”\n\nOutcome: The Broker runner smiles.\n“A direct gate to freedom. No need for smuggler ships or corporate signatures. Just step inside.”\n\nYou follow him into a hangar with a sleek, unfamiliar ship. The ramp closes behind you.\n\nA sharp hiss.\n\nThe floor beneath you turns transparent… revealing you’re not in a ship. You’re in a containment pod.\n\nHe speaks over comms:\n“Congratulations. You’ve been delivered. Payment received.”",
    "choices": {}
  },
  "Engage with the guard ship using protocol that AI knows": {
    "text": "NODE-9, spoof our ID. Make us look like a corporate salvage team.\n\nOutcome: NODE-9 engages its corrupted protocols, repurposing fragments of old access codes and voice logs.\n\nThe comms crackle.\nGuard Ship: “...copy that. Resume course. Next time, respond faster.”\n\nYou navigate through the asteroid belt successfully and reach the 3 wormholes.",
    "choices": {
      "Final Approach": "Final Approach"
    }
  },
  "Go into stealth mode": {
    "text": "Cut the engines. Power down everything. Let them pass.\n\nOutcome: The ship goes dark. The engines whine to a halt. NODE-9 hums nervously.\n\nFor a moment, there's silence.\n\nThen:\nGuard Ship: “Unregistered vessel detected. No beacon. Locking tractor beam.”\n\nLights flood the cabin. You feel the hull shudder.\n\nNODE-9 says one final thing:\n“Hiding was a statistically poor strategy. Goodbye.”\n\nGAME OVER.\n\n“Sometimes silence is the loudest answer.”",
    "choices": {}
  },
  "Dodge It": {
    "text": "Veer right! Hard and fast!\n\nOutcome: The ship jolts violently as Vex yanks the controls. You narrowly dodge the asteroid—\nBut NODE-9 screams through static:\n“Secondary mass detected—hidden in asteroid shadow. Collision imminent.”\n\nYou see it—a massive, dark behemoth of a rock, concealed behind the first one. Too close. Too fast.\n\nYour ship is obliterated.\n\nVex’s last words:\n“Well... guess I zigged when I should’ve zagged.”\n\nGAME OVER.\n\n“Even skilled pilots can’t outrun bad luck.”",
    "choices": {}
  },
  "Absorb it with your rear haul": {
    "text": "Choice B: Let It Hit the Rear Hull (Keep Going)\n\nHold course. Let it clip the tail.\n\nOutcome: Vex’s eyes widen, but she nods.\n\nThe asteroid slams into the ship’s rear, jolting the cabin and throwing you both forward. Sparks fly. Hull breach in the storage bay. One stabilizer down.\n\nNODE-9:\n“Damage report: minimal. Flight capability reduced, but stable.”\n\nVex curses, kicks the console back into life.\n“You’re a maniac. I love it. Let’s keep flying.”\n\nContinue the game, Vex safely guides you through the asteroid belt and into the 3 wormholes.",
    "choices": {
      "Final Approach": "Final Approach"
    }
  },
  "Trust": {
    "text": "Game Over\nSells you out to the government as he is an agent working on the streets to lure out criminals.",
    "choices": {}
  },
  "Final Approach": {
    "text": "",
    "choices": {
      "The Blue Swirl": "The Blue Swirl",
      "The Crimson Spiral": "The Crimson Spiral",
      "The Purple Void": "The Purple Void"
    }
  },
  "The Blue Swirl": {
    "text": "Description: Calm, steady rotations. Almost hypnotic. Emits a faint hum that resonates in your chest.\nOutcome:\n You emerge on a peaceful Earth-like world—lush, untouched. There’s no sign of civilization, but the air is breathable, the water clean.\n\nYou survive",
    "choices": {}
  },
  "The Crimson Spiral": {
    "text": "Description: Twisting violently, edges sparking like it’s tearing itself apart. The console glitches when scanned.\nOutcome:\n You arrive in a war-torn industrial planet, ruled by megacorps even more ruthless than Earth. But… there’s a resistance.\n\nYou can rise in power, or fall in the chaos.",
    "choices": {}
  },
  "The Purple Void": {
    "text": "Description: Nearly silent. Emits strange patterns of light that don’t follow any rhythm. Time feels… stretched.\nOutcome:\n You exit into a reality where time, memory, and identity are fluid. You’re not sure if you’re still you. Echoes of the past replay. You may be in a simulation, or a dream… or another layer of existence entirely.",
    "choices": {}
  }
}
